app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Beethoven"], ["created_by", "1"], ["created_at", "2022-02-24 00:46:07.561839"], ["updated_at", "2022-02-24 00:46:07.561839"]]
---
  def create
    # create todos belonging to current user
    @todo = current_user.todos.create!(todo_params)