app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ash"], ["email", "ash@email.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-02-24 00:38:47.173059"], ["updated_at", "2022-02-24 00:38:47.173059"]]
---
  def create
    user = User.create!(user_params)